app/Models/MyModel.php

SELECT *
FROM `products`
WHERE `id` = '3'
SELECT *
FROM `products`
---
    public function getData($id = false) {
        if($id) {
            return $this->db->table('products')->where('id',$id)->get()->getResult();
        } else {
            return $this->db->table('products')->get()->getResult();

INSERT INTO `products` (`product`, `category`, `qty`, `price`) VALUES ('test', 'others', '10', '500000')
---
    public function insertData() {
        $data = array(
            'product'=>$this->input->getPost('product'),
            'category'=>$this->input->getPost('category'),
            'qty'=>$this->input->getPost('qty'),
            'price'=>$this->input->getPost('price')
        );
        $this->db->table('products')->insert($data);

DELETE FROM `products`
WHERE `id` = '5'
SELECT *
FROM `products`
WHERE `id` = '1'
---
    public function deleteData() {
        $id = $this->input->getPost('deleteId');
        $this->db->table('products')->where('id',$id)->delete();

UPDATE `products` SET `product` = 'monitor2', `category` = 'elektronik2', `qty` = '50', `price` = '4000000'
WHERE `id` = '3'
---
    public function updateData() {
        $id = $this->input->getPost('editId');
        $updateData = array(
            'product'=>$this->input->getPost('newProduct'),
            'category'=>$this->input->getPost('newCategory'),
            'qty'=>$this->input->getPost('newQty'),
            'price'=>$this->input->getPost('newPrice')
        );
        $this->db->table('products')->where('id', $id)->update($updateData);